#include <iostream>



int main() 
{
	setlocale(LC_ALL, "Russian");

	// Шаблоны в классах.
	// Статические поля и методы.
	/*
	// Публичный интерфейс - Что ты сможете сделать с классом.
	
	// Что входит в публичный интерфейс:
	// 1. Публичные поля и методы.
	// 2. Дружественные классы и функции. Которые возращают или принимают. Сторонние классы в функциях с котороми мы работает. | Они не переходят к наследникам |.
	// 3. Сторонние связанные классы и функции. Они не объявленны дружественно.
	// 4. Статические поля и функции. | Они не переходят напрямую к наследнкам |.
	// 2/3 не рекомендуется соединять в коде.*/

	

	return{};
}